# -*- coding: utf-8 -*-
import os, sys, codecs
# путь к файлу - текстовому контейнеру
fpath = input("read path: u''+ ");
# открываем его
f = codecs.open(fpath, "r", "utf-8");
# читаем содержимое контейнера в переменную
ftext = f.read();
# закрываем файл
f.close();

# записываем в переменную длину текста в контейнере
lftext = len(ftext);
# создаем пустое значенин встроенной информации в контейнер (строка, в которой символы 0 и 1 представляют двоичную последовательность)
d = "";
# начинаем обрабатывать с первого символа и по последний (цикл)
for i in range(1, lftext):
# если символ окажется пробелом (в кодировке utf-8 - 32)
 if ord(ftext[i]) == 32:
# то записываем 0 в строку
  d = d + "0";
# иначе
 else:
# если встретим пустой пробел (в кодировке utf-8 - 141)
  if ord(ftext[i]) == 141:
# то записываем 1 в строку
   d = d + "1";

# верхняя граница байта - 8
k = 8;
# создаем пустую строку самого секретного слова
n = str();
# пока предел байтов меньше длины всей последовательности, выполняем
while(k < len(d)):
# копируем в строку очередной байт, представленный символами 0 и 1
 p = d[k - 8:k:1];
# переводим значение в число, которое указано в кодировке utf-8, а потом это число в символ секретного слова
 n = n + chr(int(p, 2));
# увеличиваем границы байта
 k = k + 8;

# вывод секретного слова
print(n);