# *-* coding: utf-8 -*-
import os, sys, codecs
# путь к файлу текстовому контейнеру
fpath = input("read path: u''+ ");
# открываем его
f = codecs.open(fpath, "r", "utf-8");
# читаем содержимое из контейнера
ftext = f.read();
# закрываем файл
f.close();

# ввод секретного слова
s = input("stego: ");
# переводим в байтовую последовательность секретное слово
s = bytes(s, encoding = "utf-8");
#создаем пустую строку, куда будет записовать побитно секретное слово
d = "";
# до длины
for l in range(len(s)):
# до размерности байта
 for j in range(8):
# записываем побитно очередной символ - строка, представленная символами 0 и 1
  d = d + str(s[l] >> (7 - j) & 1);

# длина текста
lftext = len(ftext);
# пустой текст контейнера, в котором будет секретное слово
stext = str();
# счетчик битов секретного слова
k = 0;

#от первого и до последнего символа
for i in range(1, lftext):
# пустой символ
 simb = str();
# если счетчик не превзошел длину битов
 if k < len(d):
# если очередной символ пробел (в кодировке utf-8 - 32)
  if ord(ftext[i]) == 32:
# если наш бит равен 1
   if d[k] == "1":
# то символ равен пустому пробелу (в кодировкн utf-8 - 141)
    simb = chr(141);
# увеличиваем счетчик битов
   k = k + 1;
# если символ не равен пустому пробелу
 if simb != chr(141):
# то записываем очередной символ
  simb = ftext[i];
# добавляем символ в выходную последовательность контейнера (текст)
 stext = stext + simb;

# путь для создания нового контейнера с содержимым прошлого + секретным словом
fpath = input("write path: u''+ ");
# открываем файл для записи
f = codecs.open(fpath, "w", "utf-8");
# записываем в контейнер последовательность символов из контейнера + секретное слово
f.write(stext);
# закрываем файл
f.close();